import React from 'react';

const Blog = () => {
    return (
        <div className='d-flex justify-content-center align-items-center  px-5 text-center '>
            <div style={{ width: "800px", height: "800px" }} className='  bg-light mt-5 rounded rounded-4'>

                <h2 className='mt-5'> Difference between authorization and authentication</h2>
                <p> যদিও authorization and authentication প্রায়শই বিনিময়যোগ্যভাবে  ব্যবহার করা হয়, তারা সাইবার আক্রমণ থেকে একটি সংস্থাকে রক্ষা করতে ব্যবহৃত পৃথক প্রক্রিয়া। যেহেতু ডেটা লঙ্ঘনগুলি ফ্রিকোয়েন্সি এবং সুযোগ উভয়  ক্ষেত্রেেই বাড়তে থাকে, প্রমানীকরণ এবং অনুমোদন হল গোপনীয় ডেটা ভুল তাতে পড়া রোধ করার জন্য প্রতিরক্ষার প্রথম লাইন। ফলস্বরূপ শক্তিশালী authorization and authentication পদ্ধতি প্রতিটি সংস্থার সামগ্রিক নিরাপত্তা কৌশলের একটি গুরুত্বপূর্ন অংশ হওয়া উচিত। সুতরাং authorization and authentication মধ্যে পার্থক্য কী? সহজভাবে বলতে গেলে, authorization হলে ব্যবহারকারীর কোন নির্দিষ্ট অ্যাপ্লিকেশন, ফাইল এবং ডেটাকে অ্যাক্সেস বয়েছে তা যাচাই করার প্রক্রিয়া। পরিস্থিতি এমন একটি এয়ারলাইনের মতো যা নির্ধারণ করতে হবে কোন লোক বোর্ডে আসতে পারে। প্রথম ধাপ হল একজন ব্যবহারকারী পরিচয় নিশ্চিত করা যাতে তারা কে বলে তারা তা নিশ্চিত করা। একবার  ব্যবহারকারী পরিচয় নির্ণয় করা হয়ে গেলে, দ্বিতীয় ধাপে যাত্রীর অ্যাক্সেস আছে এমন কোনো বিশেষ পরিষেবা যাচাই করা হচ্ছে, তা সে ফাস্ট-ক্লাস ফ্লাইং হোক বা ভিআইপি লাইঞ্জে যাওয়া হোক। ডিজিটাল বিশ্বে,authorization and authentication  এই একই লক্ষ্যগুলি অর্জন করে। authorization  ব্যবহার করা হয় যাচাই করার জন্য যে ব্যবহারকারীরা আসলেই তাদের প্রতিনিধিত্ব করে। তাদের প্রতিনিধিত্ব করে একবার এটি নিশ্চিত হয়ে গেলে, ব্যবহারকারীকে বিভিন্ন ধরণের ব্যবহারকারীদের জন্য প্রতিষ্ঠিত নিয়মের উপর নির্ভর করে বিভিন্ন স্তরের তথ্য অ্যাক্সেস করার  এবং নির্দিষ্ট ফাংশন সম্পাদন করার অনুমতি দেওয়ার জন্য অনুমোদন ব্যবহার করা হয়। </p>

                <h2>Why are you using firebase? What other options do you have to implement authentication?</h2>
                <p> Google দ্বারা  Firebase নিম্মলিখিতগুলির জন্য ব্যবহার করা যেতে পারে: Firebase ডাটাবেসের সমস্ত ডেটা রিয়েল-টাইম পরিচালনা করে। সুতরাং, ডাটাবেস থেকে ডেটা আদান - প্রদান সহজ  এবং দ্রুত। তাই, আপনি যদি লাইভ স্ট্রিমিং, চ্যাট মেসেজিং ইত্যাদির মতো মোবাইল অ্যাপ তৈরি করতে চান, তাহলে আপনি  Firebase  ব্যবহার করতে পারেন। ব্যবহারকারীর  authentication এমন  একটি পদ্ধতি যা authorization ব্যবহারকারীদের সংবেদনশীল তথ্য অ্যাক্সেস করা থেকে বিরত রাখে। উদাহরণস্বরূপ, ব্যবহারকারী A  শুধুমাত্র প্রাসঙ্গিক তথ্য অ্যাক্সেস করতে পারে এবং ব্যবহারকারী B এর সংরেদনশীল তথ্য দেখতে পারে না। ব্যবহারকারীর authentication নিরাপদ না হলে সাইবার অপরাধীরা একটি সিস্টেমে অ্যাক্সেস পেতে পারে এবং তথ্য চুরি করতে পারে। Adobe, Equifax ,  এবং  Yahoo এর মতো ডেটা লঙ্গন সংস্থাগুলি যখন তাদের ব্যবহারকারীর authentication সুরক্ষিত করতে ব্যর্থ হয় তখন কী ঘটে তার উদারহণ।  </p>
            </div>
        </div>
    );
};

export default Blog;